[{"available": 9, "rating": 4, "price_incl_tax": "48.63", "description": "\"This is a book about making art. Ordinary art. Ordinary art means something like: all art not made by Mozart. After all, art is rarely made by Mozart-like people; essentially—statistically speaking—there aren't any people like that. Geniuses get made once-a-century or so, yet good art gets made all the time, so to equate the making of art with the workings of genius remov \"This is a book about making art. Ordinary art. Ordinary art means something like: all art not made by Mozart. After all, art is rarely made by Mozart-like people; essentially—statistically speaking—there aren't any people like that. Geniuses get made once-a-century or so, yet good art gets made all the time, so to equate the making of art with the workings of genius removes this intimately human activity to a strangely unreachable and unknowable place. For all practical purposes making art can be examined in great detail without ever getting entangled in the very remote problems of genius.\"—-from the IntroductionArt & Fear explores the way art gets made, the reasons it often doesn't get made, and the nature of the difficulties that cause so many artists to give up along the way. The book's co-authors, David Bayles and Ted Orland, are themselves both working artists, grappling daily with the problems of making art in the real world. Their insights and observations, drawn from personal experience, provide an incisive view into the world of art as it is expeienced by artmakers themselves.This is not your typical self-help book. This is a book written by artists, for artists -— it's about what it feels like when artists sit down at their easel or keyboard, in their studio or performance space, trying to do the work they need to do. First published in 1994, Art & Fear quickly became an underground classic. Word-of-mouth response alone—now enhanced by internet posting—has placed it among the best-selling books on artmaking and creativity nationally.Art & Fear has attracted a remarkably diverse audience, ranging from beginning to accomplished artists in every medium, and including an exceptional concentration among students and teachers. The original Capra Press edition of Art & Fear sold 80,000 copies.An excerpt:Today, more than it was however many years ago, art is hard because you have to keep after it so consistently. On so many different fronts. For so little external reward. Artists become veteran artists only by making peace not just with themselves, but with a huge range of issues. You have to find your work... ...more", "price": 48.63, "tax": "0.00", "in_stock": "In stock (9 available)", "genre": "Art", "price_excl_tax": "48.63", "title": "Art and Fear: Observations on the Perils (and Rewards) of Artmaking", "upc": "d6d9ffea95f2f8bf", "reviews": "0", "product type": "Books"}, {"available": 14, "rating": 3, "price_incl_tax": "49.05", "description": "Exquisite images from award-winning National Geographic photographer Robert Clark offer a captivating perspective on the vast beauty and myriad functions of a seemingly simple thing: the bird feather. Each detailed close-up is paired with informative text about the utility and evolution of the feather it depicts, making this handsome marriage of art and science the ideal g Exquisite images from award-winning National Geographic photographer Robert Clark offer a captivating perspective on the vast beauty and myriad functions of a seemingly simple thing: the bird feather. Each detailed close-up is paired with informative text about the utility and evolution of the feather it depicts, making this handsome marriage of art and science the ideal gift for bird lovers, natural history buffs, and photography enthusiasts. ...more", "price": 49.05, "tax": "0.00", "in_stock": "In stock (14 available)", "genre": "Art", "price_excl_tax": "49.05", "title": "Feathers: Displays of Brilliant Plumage", "upc": "9194ae88379dbf1a", "reviews": "0", "product type": "Books"}, {"available": 8, "rating": 4, "price_incl_tax": "10.29", "description": "Now in paperback, Umberto Eco’s groundbreaking and much-acclaimed first illustrated book has been a critical success since its first publication in 2004. What is beauty? Umberto Eco, among Italy’s finest and most important contemporary thinkers, explores the nature, the meaning, and the very history of the idea of beauty in Western culture. The profound and subtle text is Now in paperback, Umberto Eco’s groundbreaking and much-acclaimed first illustrated book has been a critical success since its first publication in 2004. What is beauty? Umberto Eco, among Italy’s finest and most important contemporary thinkers, explores the nature, the meaning, and the very history of the idea of beauty in Western culture. The profound and subtle text is lavishly illustrated with abundant examples of sublime painting and sculpture and lengthy quotations from writers and philosophers. This is the first paperback edition of History of Beauty, making this intellectual and philosophical journey with one of the world’s most acclaimed thinkers available in a more compact and affordable format.From the Trade Paperback edition ...more", "price": 10.29, "tax": "0.00", "in_stock": "In stock (8 available)", "genre": "Art", "price_excl_tax": "10.29", "title": "History of Beauty", "upc": "8a150fd8ff5d7686", "reviews": "0", "product type": "Books"}, {"available": 7, "rating": 2, "price_incl_tax": "32.34", "description": "An A to Z guide to 500 great painters and sculptors from medieval to modern times, it debunks art historical classifications by throwing together brilliant examples of all periods, schools, visions and techniques. Each artist is represented by a full-page colour plate of a definitive work, accompanied by explanatory and illuminating information on the image and its creator An A to Z guide to 500 great painters and sculptors from medieval to modern times, it debunks art historical classifications by throwing together brilliant examples of all periods, schools, visions and techniques. Each artist is represented by a full-page colour plate of a definitive work, accompanied by explanatory and illuminating information on the image and its creator. Glossaries of artistic movements and technical terms are included, making this a valuable work of reference as well as a feast for the eyes. By breaking with traditional classifications, The Art Book presents a fresh and original approach to art: an unparalleled visual sourcebook and a celebration of our rich and multi-faceted culture. ...more", "price": 32.34, "tax": "0.00", "in_stock": "In stock (7 available)", "genre": "Art", "price_excl_tax": "32.34", "title": "The Art Book", "upc": "4b8fa561a1e52d1c", "reviews": "0", "product type": "Books"}, {"available": 8, "rating": 3, "price_incl_tax": "43.02", "description": "When Drawing on the Right Side of the Brain was first published in 1979, it hit the New York Times bestseller list within two weeks and stayed there for more than a year. In 1989, when Dr. Betty Edwards revised the book, it went straight to the Times list again. Now Dr. Edwards celebrates the twentieth anniversary of her classic book with a second revised edition.Over the When Drawing on the Right Side of the Brain was first published in 1979, it hit the New York Times bestseller list within two weeks and stayed there for more than a year. In 1989, when Dr. Betty Edwards revised the book, it went straight to the Times list again. Now Dr. Edwards celebrates the twentieth anniversary of her classic book with a second revised edition.Over the last decade, Dr. Edwards has refined her material through teaching hundreds of workshops and seminars. Truly The New Drawing on the Right Side of the Brain, this edition includes:the very latest developments in brain researchnew material on using drawing techniques in the corporate world and in educationinstruction on self-expression through drawingan updated section on using colordetailed information on using the five basic skills of drawing for problem solving ...more", "price": 43.02, "tax": "0.00", "in_stock": "In stock (8 available)", "genre": "Art", "price_excl_tax": "43.02", "title": "The New Drawing on the Right Side of the Brain", "upc": "3eec766dda26fa64", "reviews": "0", "product type": "Books"}, {"available": 7, "rating": 4, "price_incl_tax": "41.14", "description": "This text is the 16th revised and updated edition of this introduction to art, from the earliest cave paintings to experimental art. Eight new artists from the modern period have been introduced. They are: Corot, Kollwitz, Nolde, de Chirico, Brancussi, Magritte, Nicolson and Morandi. A sequence of new endings have been added, and the captions are now fuller, including the This text is the 16th revised and updated edition of this introduction to art, from the earliest cave paintings to experimental art. Eight new artists from the modern period have been introduced. They are: Corot, Kollwitz, Nolde, de Chirico, Brancussi, Magritte, Nicolson and Morandi. A sequence of new endings have been added, and the captions are now fuller, including the medium and dimension of the works illustrated. Six fold-outs present selected large-scale works. They are: Van Eyck's Ghent Altarpiece, Leonardo's Last Supper, Botticelli's Birth of Venus, Jackson Pollock's One (Number 31, 1950), Van der Weyden's Descent from the Cross and Michelangelo's Sistine Chapel ceiling. ...more", "price": 41.14, "tax": "0.00", "in_stock": "In stock (7 available)", "genre": "Art", "price_excl_tax": "41.14", "title": "The Story of Art", "upc": "9147c5251cc99eb1", "reviews": "0", "product type": "Books"}, {"available": 18, "rating": 4, "price_incl_tax": "44.18", "description": "Banksy, Britain's now-legendary \"guerilla\" street artist, has painted the walls, streets, and bridges of towns and cities throughout the world. Not only did he smuggle his pieces into four of New York City's major art museums, he's also \"hung\" his work at London's Tate Gallery and adorned Israel's West Bank barrier with satirical images. Banksy's identity remains unknown, Banksy, Britain's now-legendary \"guerilla\" street artist, has painted the walls, streets, and bridges of towns and cities throughout the world. Not only did he smuggle his pieces into four of  New York City's major art museums, he's also \"hung\" his work at London's Tate Gallery and adorned Israel's West Bank barrier with satirical images. Banksy's identity remains unknown, but his work is unmistakable—with prints selling for as much as $45,000. ...more", "price": 44.18, "tax": "0.00", "in_stock": "In stock (18 available)", "genre": "Art", "price_excl_tax": "44.18", "title": "Wall and Piece", "upc": "ccd9ffa25efabdea", "reviews": "0", "product type": "Books"}]